"""Знайка иногда ведёт частные уроки по геометрии и ему нужно рисовать
равнобедренные треугольники. Но это рутинная операция и Знайке совсем
не хочется тратить на это своё время. Помогите ему и напишите соответствующую
программу. На вход подаётся целое число N в диапазоне [1; 30].
На выход по результатам работы программы на экран выводится равнобедренный
треугольник по такому формату: N – это высота треугольника,
основание треугольника параллельно вертикальной стороне экрана,
остальные параметры смотрите по примерам:"""


def isosceles_triangles(N):
    high = 2 * N - 1
    i = 1
    a = 1
    while i <= high:
        if i == 1 or i == high:
            print('*')
            a += 1
        elif i <= (high // 2 + 1):
            print('*'+' '*(a - 2)+'*')
            a += 1
        else:
            a -= 1
            print('*'+' '*(a - 3)+'*')
        i += 1


if __name__ == '__main__':
    N = int(input())
    isosceles_triangles(N)
